tests/pspSendPayment/OK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:psp="http://pagopa-api.pagopa.gov.it/psp/pspForNode.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <psp:pspSendPaymentRes>
         <outcome>OK</outcome>
         <transferDate>2020-11-06</transferDate>
      </psp:pspSendPaymentRes>
   </soapenv:Body>
</soapenv:Envelope>